{
  "books": [
    {
      "id": 1,
      "title": "The Tragedy of Hamlet, Prince of Denmark",
      "author": "William Shakespeare",
      "description": "Гамлет – юноша с добрым сердцем, которому было суждено увидеть мрачную изнанку жизни. Убийство отца ради выгоды его братом и женой меняет идеалистические представления героя о мире. Перед принцем встаёт сложный выбор, который будет мучить его до финала пьесы: проявить милосердие к убийцам отца или же отомстить им. Пересказав содержание «Гамлета» кратко, мы специально опустили некоторые детали шекспировской трагедии.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Hamlet_Q2_TP_1604.jpg/512px-Hamlet_Q2_TP_1604.jpg"
    },
    {
      "id": 2,
      "title": "White Fang",
      "author": "Jack London",
      "description": "Это увлекательное повествование о судьбе прирученного волка, жившего на Аляске в период «золотой лихорадки». Главной особенностью произведения является тот факт, что большая его часть показана глазами Белого Клыка. ",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/commons/1/14/JackLondonwhitefang1.jpg"
    },
    {
      "id": 3,
      "title": "Fahrenheit 451",
      "author": "Ray Bradbury",
      "description": "Роман описывает американское общество близкого будущего, в котором книги находятся под запретом; «пожарные», к числу которых принадлежит и главный герой Гай Монтэг, сжигают любые найденные книги.",
      "thumbnail": "https://ndc.book24.ru/resize/410x590/iblock/26d/26d9db277d60784f5c3fa79f8dadbb5e/0c13aaecb2d2795ce5e69046e989055f.jpg"
    },
    {
      "id": 4,
      "title": "Jonathan Livingston Seagull",
      "author": "Richard Bach",
      "description": "Джонатану опротивела скучная жизнь его клана чаек. Он был с головой погружен в смелые эксперименты с техникой полетов и жаждал высотных далей. И потому что он был не такой как все, старейшины выгоняют его из стаи. И вот наш герой отправляется за горизонты в мир великий и опасный в поисках мудрости и свободы.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/ru/c/c0/Чайка_по_имени_Джонатан_Ливингстон.jpg"
    },
    {
      "id": 5,
      "title": "Dandelion Wine",
      "author": "Ray Bradbury",
      "description": "В центре сюжета — братья Сполдинг: Дуглас (12 лет) и Том (10 лет). Повесть состоит из вереницы историй, приключившихся в маленьком городке за три летних месяца с братьями, их родственниками, соседями, друзьями, знакомыми. Дедушка Тома и Дугласа каждое лето готовит вино из одуванчиков.",
      "thumbnail": "https://img4.labirint.ru/rc/60dc279af221c85bc6a683b691adb8b7/363x561q80/books38/371388/cover.jpg?1563698662"
    }
  ],
  "author": {
    "name": "Terin Ivan",
    "group": 6407
  }
}